app/views/profiles/show.html.erb

SELECT  1 AS one FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."friend_id" = ? LIMIT ?  [["user_id", 3], ["friend_id", 1], ["LIMIT", 1]]
---

    <% if current_user.subscriptions.exists?(friend_id: @user.id) %>

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
---

<% @user.photos.each do |photo| %>