app/controllers/photos_controller.rb

    def index
      @photos = Photo.all.order('created_at DESC').paginate(page: params[:page], per_page: 6)
---
SELECT  "photos".* FROM "photos" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
SELECT COUNT(*) FROM "photos"

    def create
      @photo = current_user.photos.build(photo_params)

        if @photo.save
---
INSERT INTO "photos" ("description", "created_at", "updated_at", "user_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update

        if @photo.update(photo_params)
---
UPDATE "photos" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["image_file_name", "maxresdefault.jpg"], ["image_updated_at", "2019-05-14 12:47:32.169275"], ["updated_at", "2019-05-14 12:47:32.500393"], ["id", 7]]

    def destroy
      @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 8]]

      def owner
        @photo = current_user.photos.find_by(id: params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."user_id" = ? AND "photos"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

      def set_photo
        @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]