app/controllers/profiles_controller.rb

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."friend_id" = ? LIMIT ?  [["user_id", 3], ["friend_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."friend_id" = ? LIMIT ?  [["user_id", 2], ["friend_id", 1], ["LIMIT", 1]]
INSERT INTO "subscriptions" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["friend_id", 1], ["created_at", "2019-05-22 05:56:25.539467"], ["updated_at", "2019-05-22 05:56:25.539467"]]
---
  def subscribe
        if current_user.id == @user.id
          redirect_to profile_path(@user), notice: "Вы не можете подписаться сами на себя"
        else
              if current_user.subscriptions.exists?(friend_id: @user.id)
                redirect_to profile_path(@user), notice: "Вы уже подписанны на данного пользователя"

              else
                  @subscription = current_user.subscriptions.build
                  @subscription.friend_id = @user.id
                  @subscription.save

SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."friend_id" = ? LIMIT ?  [["user_id", 3], ["friend_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."friend_id" = ? LIMIT ?  [["user_id", 3], ["friend_id", 1], ["LIMIT", 1]]
SELECT  "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = ? AND "subscriptions"."friend_id" = ? LIMIT ?  [["user_id", 1], ["friend_id", 2], ["LIMIT", 1]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" = ?  [["id", 8]]
---
  def unsubscribe
      if current_user.id == @user.id
        redirect_to profile_path(@user), notice: "Вы не можете подписаться сами на себя"
      else
          if current_user.subscriptions.exists?(friend_id: @user.id)
            @subscription = current_user.subscriptions.find_by_friend_id(@user.id)
            @subscription.destroy

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
  def my_photos
    @photos = current_user.photos.order('created_at DESC')

SELECT "subscriptions"."friend_id" FROM "subscriptions" WHERE "subscriptions"."user_id" = ?  [["user_id", 1]]
---
  def subscribes_list
    @friends = User.where(id: current_user.subscriptions.pluck(:friend_id))